src/Enums/ПечатныеФормыМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПечатныеФормыМедицинскихКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмбулаторнаяКарта_043_У_А4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмбулаторнаяКарта_043_У_А5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяКарта_025У_04_А4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяКарта_025У_04_А5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяКарта_025У_14</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмбулаторнаяКарта_043_У_СССР_А4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмбулаторнаяКарта_043_У_СССР_А5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяКартаОртодонтическогоПациента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/МедицинскиеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МедицинскиеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМедицинскойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБезНулей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеМедКартыОртодонтПациента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/УправлениеПечатьюКлиентСтоматология/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Проверяет, проведенность документов перед печатью.
// Если есть непроведенные документы предлагает перепровести.
// Параметры
//  ПараметрКоманды - массив - ссылки на документы, которые должны быть проведены перед печатью
//
Функция ПроверитьДокументыПроведены(Знач ПараметрКоманды) Экспорт
	
	Если НЕ ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ВременнаяСсылка = ПараметрКоманды;
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(ВременнаяСсылка);
	КонецЕсли;
	МассивНепроведенныхДокументов     = ОбщегоНазначенияСтоматология.ПроверитьПроведенностьДокументов(ПараметрКоманды);
	КоличествоНепроведенныхДокументов = МассивНепроведенныхДокументов.Количество();
	
	Если КоличествоНепроведенныхДокументов > 0 Тогда
		
		Если КоличествоНепроведенныхДокументов = 1 Тогда
			ТекстВопроса = НСтр("ru = 'Чтобы распечатать документ, его требуется провести. Выполнить проведение документа и продолжить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Чтобы распечатать документы, их требуется провести. Выполнить проведение документов и продолжить?'");
		КонецЕсли;
		ДополнительныеПараметры = Новый Структура("МассивНепроведенныхДокументов, ПараметрКоманды", МассивНепроведенныхДокументов, ПараметрКоманды);
		Оповещение = Новый ОписаниеОповещения("ПроверитьДокументыПроведеныЗавершение", УправлениеПечатьюКлиентСтоматология, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат Ложь;
	Иначе
		
		Возврат ПараметрКоманды.Количество() > 0;

	КонецЕсли;  	
			
КонецФункции

// Процедура - Проверить документы проведены завершение
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Функция ПроверитьДокументыПроведеныЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ТипПроведенныхДокументов 		= Неопределено;
	ПараметрКоманды 				= ДопПараметры.ПараметрКоманды;
	МассивНепроведенныхДокументов 	= ДопПараметры.МассивНепроведенныхДокументов; 
	МассивНепроведенныхДокументов 	= ОбщегоНазначенияСтоматология.ПровестиДокументы(МассивНепроведенныхДокументов, ТипПроведенныхДокументов);
	ОповеститьОбИзменении(ТипПроведенныхДокументов);
	
	ШаблонСообщения = НСтр("ru = 'Документ %1 не проведен. Печать не возможна.'");
	Для Каждого ЭлементНД Из МассивНепроведенныхДокументов Цикл
		Найденный = ПараметрКоманды.Найти(ЭлементНД);
		Если Найденный <> Неопределено Тогда
			ПараметрКоманды.Удалить(Найденный);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Строка(ЭлементНД)), ЭлементНД);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрКоманды.Количество() > 0;
	
КонецФункции

// Процедура обработки команды печати из документа.
//
Процедура ОбработкаКоманды(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Если Результат.Значение = "ПечатьМедКарты" ИЛИ Результат.Значение = "ПечатьВкладышаКарты" ИЛИ Результат.Значение = "ВкладышМедКартыДляСтраховой" Тогда
			НужнаяСсылка = ПредопределенноеЗначение("Справочник.ВидыМедицинскихКарт.ОсновнойВидМедицинскойКарты");
			ЗначениеРеквезита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НужнаяСсылка, "ПечатнаяФорма");
			Если ЗначениеРеквезита = ПредопределенноеЗначение("Перечисление.ПечатныеФормыМедицинскихКарт.МедицинскаяКартаОртодонтическогоПациента") Тогда
				ПечатьМедицинскойКартыОртодонтическогоПациента(Результат.Значение, Параметры);			                                                 
			Иначе
				ПечатьМедкартыИВкладыша(Результат.Значение, Параметры);
			КонецЕсли;
		ИначеЕсли Результат.Значение = "ПФ_MXL_Справка" Тогда	
			ПечатьСправкиВналоговую(Результат.Значение, Параметры);
			//ИначеЕсли Результат.Значение = "МедицинскаяКартаОртодонтическогоПациента" Тогда
			//	ПечатьМедицинскойКартыОртодонтическогоПациента(Результат.Значение, Параметры);
		ИначеЕсли Результат.Значение = "ЛистУчетаДозовыхНагрузок" Тогда
			ПечатьУказанногоМакетаМедКарты("ЛистУчетаДозовыхНагрузок", Параметры)		
		ИначеЕсли Результат.Значение = "ПФ_MXL_РасшифровкаНачисления" ИЛИ Результат.Значение = "ПФ_MXL_РасшифровкаНачисленияПодробно" Тогда	
			Если УправлениеПечатьюКлиентСтоматология.ПроверитьДокументыПроведены(Параметры.МассивДокументов) Тогда
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
				"Документ." + Параметры.ИмяДокумента, Результат.Значение, 
				Параметры.МассивДокументов,
				Неопределено,
				Неопределено
				); 
			КонецЕсли; 		
		Иначе
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ." + Параметры.ИмяДокумента, Результат.Значение, 
			Параметры.МассивДокументов,
			Неопределено,
			Неопределено
			); 	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры 

// Процедура печати медкарты и её вкладыша.
//
Процедура ПечатьМедкартыИВкладыша(ВариантПечати, Параметры, ВыбранныйВариант = Неопределено) 
	
	КартаКлиента = Неопределено;
	КартаКлиентаМассивом = Новый Массив;
	МедицинскиеКартыКлиента = УправлениеПечатьюВызовСервераСтоматология.ПолучитьМедКартыКлиентаПоПриему(Параметры.МассивДокументов);
	
	Если МедицинскиеКартыКлиента.Количество() = 0 Тогда
		
		Если ВыбранныйВариант <> КодВозвратаДиалога.Нет Тогда
			ДополнительныеПараметры = Новый Структура("ВариантПечати, Параметры", ВариантПечати, Параметры);
			Оповещение = Новый ОписаниеОповещения("СозданиеМедецинскойКартыПациента", ЭтотОбъект, ДополнительныеПараметры);
			ТекстВопроса = "У клиента нет медицинской карты! Создать?"; 
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
	ИначеЕсли МедицинскиеКартыКлиента.Количество() = 1 Тогда
		КартаКлиента = МедицинскиеКартыКлиента[0];
	Иначе 
		Параметры.Вставить("ВариантПечати", ВариантПечати); 	 
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаКомандыПечатьМедКартыЗавершение", ОбщегоНазначенияКлиент, Параметры);
		КартаКлиента = ОткрытьФорму("Справочник.МедицинскиеКарты.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Ссылка", МедицинскиеКартыКлиента)),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	Если КартаКлиента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВидМедКарты = ОбщегоНазначения.ПолучитьЗначениеРеквизита(КартаКлиента, "ВидМедицинскойКарты.ПечатнаяФорма", "ВидМедицинскойКарты"); 
	
	Если ВидМедКарты = ПредопределенноеЗначение("Перечисление.ПечатныеФормыМедицинскихКарт.МедицинскаяКартаОртодонтическогоПациента") Тогда
		Если ВариантПечати = "ПечатьВкладышаКарты" ИЛИ ВариантПечати = "ВкладышМедКартыДляСтраховой" Тогда 
			ОбщегоНазначения.СообщитьПользователю("У данного вида медицинской карты нет вкладыша");			
		Иначе
			ОткрытьФорму("Справочник.МедицинскиеКарты.Форма.ФормаОртодонтическогоПациента", Новый Структура("Ключ", КартаКлиента), , Истина);  
		КонецЕсли;
	Иначе   	
		КартаКлиентаМассивом.Добавить(КартаКлиента);
		
		ДопПараметрыДляПечати = Новый Структура("КартаКлиентаМассивом, ВариантПечати", КартаКлиентаМассивом, ВариантПечати); 
		ОписаниеОповещения = Новый ОписаниеОповещения("НапечататьВкладышМедКартыПослеВыбораПриемов", ЭтотОбъект, ДопПараметрыДляПечати);
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("МассивДокументов", Параметры.МассивДокументов);
		ПараметрыОткрытияФормы.Вставить("Контрагент", Параметры.Контрагент);
		ПараметрыОткрытияФормы.Вставить("ТолькоПроведенныеДокументы", ?(Параметры.Свойство("ТолькоПроведенныеДокументы"), Параметры.ТолькоПроведенныеДокументы, Ложь));
		
		ОткрытьФорму("Справочник.МедицинскиеКарты.Форма.ФормаПечатиВкладышейКарт", ПараметрыОткрытияФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	Если ВыбранныйВариант = КодВозвратаДиалога.Да Тогда
		
		ПоказатьПредупреждение(, "Медицинская карта создана!", 1);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Создание медецинской карты пациента
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура СозданиеМедецинскойКартыПациента(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		МассивДокументов = ДопПараметры.Параметры.МассивДокументов;
		УправлениеПечатьюВызовСервераСтоматология.СоздатьМедКарту(МассивДокументов);	
		 
		МедицинскиеКартыКлиента = УправлениеПечатьюВызовСервераСтоматология.ПолучитьМедКартыКлиентаПоПриему(МассивДокументов);
		
	КонецЕсли;
	
	ВариантПечати 	= ДопПараметры.ВариантПечати;
	Параметры 		= ДопПараметры.Параметры; 
	ПечатьМедкартыИВкладыша(ВариантПечати, Параметры, Результат);
	
КонецПроцедуры

// Процедура осуществления печати медкарты и вкладыша после выбора приемов пациента
//
Процедура НапечататьВкладышМедКартыПослеВыбораПриемов(Результат, Параметры) Экспорт 
	
	Если НЕ Параметры.Свойство("КартаКлиентаМассивом") ИЛИ Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Параметры.Свойство("ВариантПечати") И Параметры.ВариантПечати = "ВкладышМедКартыДляСтраховой" Тогда
		ПередаваемыеПараметрыПечати = Новый Структура("ВкладышМедКартыДляСтраховой", Результат);
		ИмяМакета = "ВкладышМедКартыДляСтраховой";
	Иначе
		ПередаваемыеПараметрыПечати = Новый Структура(?(Параметры.Свойство("ВариантПечати") И Параметры.ВариантПечати = "ПечатьВкладышаКарты", "ПечатьВкладыша", "ПечатьМедКарты"), Результат);
		ИмяМакета = "ПечатьМедКарты";
	КонецЕсли;
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.МедицинскиеКарты", ИмяМакета, Параметры.КартаКлиентаМассивом, Неопределено, ПередаваемыеПараметрыПечати);
	
КонецПроцедуры

// Процедура печати справки в налоговую.
//
Процедура ПечатьСправкиВналоговую(ВариантПечати, Параметры) 
	
	ДополнительныеПараметры = Новый Структура("ВариантПечати, Параметры", ВариантПечати, Параметры);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПечатьСправкиВНалоговуюЗавершение", ЭтотОбъект, ДополнительныеПараметры); 
	ОткрытьФорму("Документ.Прием.Форма.ФормаВыбораПриемовДляПечати", Новый Структура("МассивДокументов, ПечатьСправки", Параметры.МассивДокументов, Истина),,,,,ОповещениеОЗакрытии);
		
КонецПроцедуры

// Процедура - Печать справки в налоговую завершение
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ПечатьСправкиВНалоговуюЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Отмена ИЛИ Результат = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Массив") Тогда 
		
		СправкаВНалоговую = УправлениеПечатьюВызовСервераСтоматология.НайтиСоздатьДокументСправкаВНалоговую(Результат, Результат);
		Результат.Добавить(СправкаВНалоговую);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ." + ДопПараметры.Параметры.ИмяДокумента, ДопПараметры.ВариантПечати, Результат, Неопределено, Неопределено); 
		
	КонецЕсли;
	
КонецПроцедуры 

// Процедура печати медкарты ортодонтического пациента.
//
Процедура ПечатьМедицинскойКартыОртодонтическогоПациента(ВариантПечати, Параметры)
	
	МедицинскиеКартыКлиента = УправлениеПечатьюВызовСервераСтоматология.ПолучитьМедКартыКлиентаПоПриему(Параметры.МассивДокументов, ВариантПечати);
	Если МедицинскиеКартыКлиента.Количество() = 0 Тогда	
		
		ДополнительныеПараметры = Новый Структура("ВариантПечати, Параметры", ВариантПечати, Параметры);
		Оповещение = Новый ОписаниеОповещения("СозданиеМедицинскойКартыОртодонтическогоПациента", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = "У клиента нет медицинской карты ортодонтического пациента! Создать?"; 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли МедицинскиеКартыКлиента.Количество() = 1 Тогда
		
		КартаКлиента = МедицинскиеКартыКлиента[0];
		ОткрытьФорму("Справочник.МедицинскиеКарты.Форма.ФормаОртодонтическогоПациента", Новый Структура("Ключ", КартаКлиента), , Истина);
		
	Иначе
		
		Параметры.Вставить("ВариантПечати", "ПечатьКартыОртодонтическогоПациента");
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаКомандыПечатьМедКартыЗавершение", ОбщегоНазначенияКлиент, Параметры);
		КартаКлиента = ОткрытьФорму("Справочник.МедицинскиеКарты.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Ссылка", МедицинскиеКартыКлиента)),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Создание медицинской карты ортодонтического пациента
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура СозданиеМедицинскойКартыОртодонтическогоПациента(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Параметры     = ДопПараметры.Параметры;
		ВариантПечати = ДопПараметры.ВариантПечати;
		УправлениеПечатьюВызовСервераСтоматология.СоздатьМедКарту(Параметры.МассивДокументов, ВариантПечати);	
		МедицинскиеКартыКлиента = УправлениеПечатьюВызовСервераСтоматология.ПолучитьМедКартыКлиентаПоПриему(Параметры.МассивДокументов, ВариантПечати);
		
		Если ЗначениеЗаполнено(МедицинскиеКартыКлиента) Тогда
			
			КартаКлиента = МедицинскиеКартыКлиента[0];
			
		КонецЕсли;
		
		ОткрытьФорму("Справочник.МедицинскиеКарты.Форма.ФормаОртодонтическогоПациента", Новый Структура("Ключ", КартаКлиента), , Истина);
		ПоказатьПредупреждение(, "Медицинская карта создана!", 1);
		
	КонецЕсли;

КонецПроцедуры

// Процедура - Печать указанного макета мед карты
//
Процедура ПечатьУказанногоМакетаМедКарты(МакетМедКарты, Параметры)
	
	Если НЕ ЗначениеЗаполнено(МакетМедКарты) Тогда
		Возврат;
	КонецЕсли;
	
	Если МакетМедКарты = "ЛистУчетаДозовыхНагрузок" Тогда
		
		Контрагент = ?(Параметры.Свойство("Контрагент"), Параметры.Контрагент, ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.МедицинскиеКарты", МакетМедКарты, Контрагент, Неопределено, Новый Структура("Контрагент", Контрагент));	
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
